### Import dependencies

In [20]:
import pandas as pd
import numpy as np

### Import dataset

In [13]:
pop_df = pd.read_csv("Data/population_total.csv")
happ_df = pd.read_csv("Data/hapiscore_whr.csv")
inet_df = pd.read_csv("Data/internet_users.csv")
suic_df = pd.read_csv("Data/suicide_total_deaths.csv")
gini_df = pd.read_csv("Data/inequality_index_gini.csv")

### Investigate dataset

#### Steps:
- read in dataset
- check the following:
    - null values
    - decide what to do with null values (drop, fill with 0, average, etc)
    - what columns to keep (drop unneccessary columns)
    - shape

In [15]:
# Check imported datasets
pop_df.head(3)

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2091,2092,2093,2094,2095,2096,2097,2098,2099,2100
0,Afghanistan,3280000,3280000,3280000,3280000,3280000,3280000,3280000,3280000,3280000,...,76600000,76400000,76300000,76100000,76000000,75800000,75600000,75400000,75200000,74900000
1,Albania,400000,402000,404000,405000,407000,409000,411000,413000,414000,...,1330000,1300000,1270000,1250000,1220000,1190000,1170000,1140000,1110000,1090000
2,Algeria,2500000,2510000,2520000,2530000,2540000,2550000,2560000,2560000,2570000,...,70400000,70500000,70500000,70600000,70700000,70700000,70700000,70700000,70700000,70700000

In [16]:
happ_df.head(3)

,country,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,NaN,NaN,NaN,0.372,0.440,0.476,0.383,0.378,0.357,0.313,0.398,0.422,0.266,0.269,0.257
1,Albania,NaN,NaN,0.463,NaN,0.549,0.527,0.587,0.551,0.455,0.481,0.461,0.451,0.464,0.500,0.488
2,Algeria,NaN,NaN,NaN,NaN,NaN,0.546,0.532,0.560,NaN,0.635,NaN,0.534,0.525,0.504,0.501

In [17]:
inet_df.head(3)

,country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,4.0,5.0,5.45,5.9,7.0,8.26,NaN,11.4,NaN,NaN
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,45.0,49.0,54.70,57.2,60.1,63.30,66.4,71.8,NaN,69.6
2,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,12.5,14.9,18.20,22.5,29.5,38.20,42.9,47.7,49.0,NaN

In [18]:
inet_df.head(3)

,country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,4.0,5.0,5.45,5.9,7.0,8.26,NaN,11.4,NaN,NaN
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,45.0,49.0,54.70,57.2,60.1,63.30,66.4,71.8,NaN,69.6
2,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,12.5,14.9,18.20,22.5,29.5,38.20,42.9,47.7,49.0,NaN

In [19]:
gini_df.head(3)

,country,1967,1968,1969,1970,1971,1972,1973,1974,1975,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,29.0,NaN,34.6,32.9,33.7,33.2,NaN
1,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,27.6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,51.3

### Notes

- see what years to use and drop the rest
- transpose datasets
- merge datasets

In [4]:
# Unpivot dataframe
population_df = population_df.melt(id_vars = 'country', var_name = 'year', value_name = 'population_total', ignore_index=True)

In [7]:
population_df.head(10)

               country  year  population_total
0          Afghanistan  1800           3280000
1              Albania  1800            400000
2              Algeria  1800           2500000
3              Andorra  1800              2650
4               Angola  1800           1570000
5  Antigua and Barbuda  1800             37000
6            Argentina  1800            534000
7              Armenia  1800            413000
8            Australia  1800            200000
9              Austria  1800           3000000